In [1]:
import numpy as np
import pandas as pd

1. Load the IMDB dataset and read

In [3]:
data=pd.read_csv("imdb-data.csv")
type(data)

pandas.core.frame.DataFrame

2. Read the dataset

In [4]:
data.head()

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0

[5 rows x 12 columns]

3. Understand some basic information about the dataset and Inspect the dataframe Inspect the dataframe's columns, shapes, variable types etc.

In [7]:
data.shape

(1000, 12)

In [9]:
data.size

12000

In [10]:
data.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [13]:
data.describe()

              Rank         Year  ...  Revenue (Millions)   Metascore
count  1000.000000  1000.000000  ...          872.000000  936.000000
mean    500.500000  2012.783000  ...           82.956376   58.985043
std     288.819436     3.205962  ...          103.253540   17.194757
min       1.000000  2006.000000  ...            0.000000   11.000000
25%     250.750000  2010.000000  ...           13.270000   47.000000
50%     500.500000  2014.000000  ...           47.985000   59.500000
75%     750.250000  2016.000000  ...          113.715000   72.000000
max    1000.000000  2016.000000  ...          936.630000  100.000000

[8 rows x 7 columns]

4. Understand some basic information about the dataset and Inspect the dataframe Inspect the dataframe's columns, shapes, variable types etc.

In [16]:
data['Director'].head(10)

0              James Gunn
1            Ridley Scott
2      M. Night Shyamalan
3    Christophe Lourdelet
4              David Ayer
5             Yimou Zhang
6         Damien Chazelle
7              Sean Foley
8              James Gray
9           Morten Tyldum
Name: Director, dtype: object

In [19]:
data.describe()['Runtime (Minutes)']['mean']

113.172

In [20]:
data['Runtime (Minutes)'].mean()

113.172

In [21]:
data['Revenue (Millions)'].max()

936.63

In [22]:
data[data['Revenue (Millions)'] == 936.63]

    Rank  ... Metascore
50    51  ...      81.0

[1 rows x 12 columns]

In [24]:
data[:5]

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0
3     4                     Sing  ...             270.32      59.0
4     5            Suicide Squad  ...             325.02      40.0

[5 rows x 12 columns]

In [25]:
data.iloc[1:5,6:]

   Year  Runtime (Minutes)  Rating   Votes  Revenue (Millions)  Metascore
1  2012                124     7.0  485820              126.46       65.0
2  2016                117     7.3  157606              138.12       62.0
3  2016                108     7.2   60545              270.32       59.0
4  2016                123     6.2  393727              325.02       40.0

In [26]:
data['Rank']

0         1
1         2
2         3
3         4
4         5
       ...
995     996
996     997
997     998
998     999
999    1000
Name: Rank, Length: 1000, dtype: int64

In [27]:
data.iloc[:,1:3].head(10)

                     Title                       Genre
0  Guardians of the Galaxy     Action,Adventure,Sci-Fi
1               Prometheus    Adventure,Mystery,Sci-Fi
2                    Split             Horror,Thriller
3                     Sing     Animation,Comedy,Family
4            Suicide Squad    Action,Adventure,Fantasy
5           The Great Wall    Action,Adventure,Fantasy
6               La La Land          Comedy,Drama,Music
7                 Mindhorn                      Comedy
8       The Lost City of Z  Action,Adventure,Biography
9               Passengers     Adventure,Drama,Romance

5. Data Selection – Based on Conditional filtering

In [28]:
a=data[data['Rating']>8.5][["Revenue (Millions)"]]
type(a)
a.sort_values(by= "Revenue (Millions)",ascending=True)

     Revenue (Millions)
96                 4.68
117               11.15
249               13.18
36               187.99
80               292.57
54               533.32

In [29]:
data[ data['Rating']==1.900000][['Director']]

            Director
829  Jason Friedberg

In [30]:
data[data['Year']==2015][['Revenue (Millions)']].max()

Revenue (Millions)    936.63
dtype: float64

6. Groupby operations

In [31]:
data.groupby('Year')[["Rank"]].count()

      Rank
Year
2006    44
2007    53
2008    52
2009    51
2010    60
2011    63
2012    64
2013    91
2014    98
2015   127
2016   297

In [32]:
data.groupby('Year')[["Rank"]].count().sum()

Rank    1000
dtype: int64

7. Sorting operation

In [33]:
data.groupby('Year')[["Rank"]].count().sort_values(by = 'Rank',ascending = True)

      Rank
Year
2006    44
2009    51
2008    52
2007    53
2010    60
2011    63
2012    64
2013    91
2014    98
2015   127
2016   297

In [34]:
data.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [35]:
data[data['Year']==2006].sort_values(by = 'Revenue (Millions)',ascending = False).head(5)

     Rank  ... Metascore
78     79  ...      53.0
221   222  ...      73.0
626   627  ...      58.0
733   734  ...      46.0
113   114  ...      52.0

[5 rows x 12 columns]

8. Dealing with missing values

In [36]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [37]:
data.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [38]:
data1=data
data1.head(3)

   Rank                    Title  ... Revenue (Millions) Metascore
0     1  Guardians of the Galaxy  ...             333.13      76.0
1     2               Prometheus  ...             126.46      65.0
2     3                    Split  ...             138.12      62.0

[3 rows x 12 columns]

In [39]:
data1[['Metascore','Revenue (Millions)']].fillna(0)
data1.isnull().any()

Rank                  False
Title                 False
Genre                 False
Description           False
Director              False
Actors                False
Year                  False
Runtime (Minutes)     False
Rating                False
Votes                 False
Revenue (Millions)     True
Metascore              True
dtype: bool

In [40]:
data1.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [41]:
data1['Metascore'].fillna(0)
data1.notnull().sum()

Rank                  1000
Title                 1000
Genre                 1000
Description           1000
Director              1000
Actors                1000
Year                  1000
Runtime (Minutes)     1000
Rating                1000
Votes                 1000
Revenue (Millions)     872
Metascore              936
dtype: int64

In [42]:
data.dropna
data.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

9. Dropping columns and null values

In [43]:
data.isnull().sum()

Rank                    0
Title                   0
Genre                   0
Description             0
Director                0
Actors                  0
Year                    0
Runtime (Minutes)       0
Rating                  0
Votes                   0
Revenue (Millions)    128
Metascore              64
dtype: int64

In [44]:
data2=data.dropna()
data2.isnull().sum()

Rank                  0
Title                 0
Genre                 0
Description           0
Director              0
Actors                0
Year                  0
Runtime (Minutes)     0
Rating                0
Votes                 0
Revenue (Millions)    0
Metascore             0
dtype: int64

In [45]:
data2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 838 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                838 non-null    int64
 1   Title               838 non-null    object
 2   Genre               838 non-null    object
 3   Description         838 non-null    object
 4   Director            838 non-null    object
 5   Actors              838 non-null    object
 6   Year                838 non-null    int64
 7   Runtime (Minutes)   838 non-null    int64
 8   Rating              838 non-null    float64
 9   Votes               838 non-null    int64
 10  Revenue (Millions)  838 non-null    float64
 11  Metascore           838 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 85.1+ KB

In [46]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  872 non-null    float64
 11  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [47]:
data3=data.fillna(0)
data3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Title               1000 non-null   object
 2   Genre               1000 non-null   object
 3   Description         1000 non-null   object
 4   Director            1000 non-null   object
 5   Actors              1000 non-null   object
 6   Year                1000 non-null   int64
 7   Runtime (Minutes)   1000 non-null   int64
 8   Rating              1000 non-null   float64
 9   Votes               1000 non-null   int64
 10  Revenue (Millions)  1000 non-null   float64
 11  Metascore           1000 non-null   float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

10. Apply functions( )

In [48]:
data['Rating'].max()

9.0

In [49]:
data.columns

Index(['Rank', 'Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [50]:
data['Year'].max()

2016

In [51]:
data['Year'].min()

2006

In [52]:
data['Rating'].min()

1.9

In [53]:
data[['Rating','Year']].agg(['mean','max','min','nunique'])

          Rating      Year
mean      6.7232  2012.783
max       9.0000  2016.000
min       1.9000  2006.000
nunique  55.0000    11.000

In [54]:
data.agg({'Rating':['max','min','mean'],'Year':['nunique']})

         Rating  Year
max      9.0000   NaN
mean     6.7232   NaN
min      1.9000   NaN
nunique     NaN  11.0